# brew tap
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

# brew install
brew "bat"
brew "exa"
brew "git"
brew "kubectl"
brew "mackup"
brew "pure"
brew "pyenv"
brew "python3"
brew "yarn"

# brew cask
cask "1password"
cask "calibre"
cask "discord"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "goland"
cask "google-chrome"
cask "iterm2"
cask "logi-options-plus"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "typora"
cask "vlc"
cask "visual-studio-code"
