# brew tap
tap "buo/cask-upgrade"

# brew install
brew "bat"
brew "docker"
brew "git"
brew "kubectl"
brew "mercurial"
brew "pure"
brew "yarn"

# brew cask
cask "1password"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "logi-options-plus"
cask "obsidian"
cask "postman"
cask "rectangle"
cask "mattermost"
cask "spotify"
cask "jetbrains-toolbox"
