tap "buo/cask-upgrade"
tap "homebrew/bundle"
brew "autoconf"
brew "automake"
brew "libssh2"
brew "bat"
brew "coreutils"
brew "gcc"
brew "git"
brew "ios-deploy"
brew "kubernetes-cli"
brew "mercurial"
brew "ncurses"
brew "neovim"
brew "opencode"
brew "openssl@1.1"
brew "pandoc"
brew "pkgconf"
brew "pure"
brew "pyenv"
brew "python-setuptools"
brew "python@3.11"
brew "python@3.12"
brew "swiftformat"
brew "stow"
brew "telnet"
brew "watchman"
brew "xcbeautify"
brew "xcode-build-server"
brew "yarn"
cask "1password"
cask "android-platform-tools"
cask "arc"
cask "brave-browser"
cask "calibre"
cask "clickup"
cask "cursor"
cask "darktable"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "fliqlo"
cask "font-jetbrains-mono"
cask "ghostty"
cask "google-chrome"
cask "iterm2"
cask "logi-options+"
cask "lookaway"
cask "microsoft-edge"
cask "netnewswire"
cask "obsidian"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
vscode "astro-build.astro-vscode"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.code-runner"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "orta.vscode-jest"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "unifiedjs.vscode-mdx"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
